//#define _CRT_SECURE_NO_WARNINGS 1
//#include <stdio.h>
////求一个整形存储在内存中二进制1的个数；
//int main()
//
//{
//    int num = 0;
//    int count = 0;
//    scanf("%d", &num);
//    int i = 0;
//    for (i=0; i<32; i++)
//    {
//        if (1 == ((num>>i)&1))
//        {
//            count++;
//        }
//    }
//    //32bits
//    //00000000000000000000000000000011
//    //00000000000000000000000000000001
//    //00000000000000000000000000000001;按位与一次计数一次；统计了补码中32位的全部的1；
//    printf("%d\n", count);
//    return 0;
//}